Repository: itlasso/itlasso
Catalog: sites/default/files/translations/editor_advanced_link-2.2.4.*.po
Languages: de

source: Title
de: Titel

source: Advanced
de: Erweitert

source: CSS classes
de: CSS-Klassen

source: Open in new window
de: In neuem Fenster öffnen

source: Populates the title attribute of the link, usually shown as a small tooltip on hover.
de: Setzt das Titel-Attribut des Links; üblicherweise als kleiner Tooltip bei Mouse-Over angezeigt.

source: Relation (rel)
de: Beziehung (rel)

source: List of CSS classes to add to the link, separated by spaces.
de: Liste von CSS-Klassen, die zum Link hinzugefügt werden sollen und jeweils durch Leerzeichen getrennt sind.

source: Add title, target etc. attributes to Text Editor's link dialog if the text format allows them.
de: Ermöglicht es, die Attribute title, target usw. zum Linkdialog des Texteditors hinzuzufügen, wenn das Textformat dies erlaubt.

source: Enabled attributes
de: Aktivierte Attribute

source: Allows linking to this content using a <a href="https://en.wikipedia.org/wiki/Fragment_identifier" target="_blank">URL fragment</a>. Must be unique.
de: Ermöglicht die Verlinkung auf diesen Inhalt mit einem <a href="https://de.wikipedia.org/wiki/Fragment_identifier" target="_blank">URL-Fragment</a>. Muss eindeutig sein.

source: Open in new window/tab
de: In neuem Fenster/Tab öffnen

source: See WCAG guidance on <a href="https://www.w3.org/WAI/WCAG21/Techniques/general/G200" target="_blank">opening links in new windows/tabs</a>.
de: Siehe WCAG-Richtlinien zum <a href="https://www.w3.org/WAI/WCAG21/Techniques/general/G200" target="_blank">Öffnen von Links in neuen Fenstern/Tabs</a>.

source: ARIA label
de: ARIA-Bezeichnung

source: Provide an alternative text value/label for assistive technologies.
de: Geben Sie einen alternativen Textwert/ein alternatives Label für unterstützende Technologien an.

source: Often used by JS galleries. When opening links in new windows/tabs, it is advised to add the noopener attribute due to security concerns.
de: Wird oft von JS-Galerien verwendet. Beim Öffnen von Links in neuen Fenstern/Tabs ist es ratsam, aufgrund von Sicherheitsbedenken das Attribut „noopener“ hinzuzufügen.

source: The noopener attribute has been added to rel.
de: Das Attribut noopener wurde zu rel hinzugefügt

source: The noopener attribute has been removed from rel.
de: Das Attribut noopener wurde von rel entfernt

source: Enabled attribute
de: Attribut Aktiviert

source: Link relationship
de: Link-Beziehung

source: These are the attributes that will appear when creating or editing links.
de: Dies sind die Attribute, die beim Erstellen oder Bearbeiten von Links angezeigt werden.
